package basic220531;

public class AbstractMain {

	public static void main(String[] args) {

// =======================================================

//		// 1. 추상 클래스는 객체로 생성 불가
//		AbstractA a = new AbstractA();
//		// ...............................................

		// 1) 내부의 함수를 직접 정의할 경우에는 사용 가능
		// 추상 클래스가 구현되면서 완성됐기 때문에 사용 가능
		AbstractA a = new AbstractA() {
			public void print() {
			}
		};
		
		a.print();
		
		// List 관련 내용 확인 요망
		
		// ...............................................

//		// 2) 인터페이스로는 만들 수 없음(?)
//		Car c = new Car();
//		// ...............................................

		// 2. 추상 클래스인 AbstractA를 상속받은 AA로는 객체로 생성 가능
		AA aa = new AA();
		aa.print();
		// ...............................................

// =======================================================
		
	}

}
