package basic220531;

public class PCompChangeMain {

	public static void main(String[] args) {

// =======================================================

//		// 1. 그동안의 객체 생성법
//		PA a = new PA();
//		PB b = new PB();
//		PC c = new PC();
//		// a.print();
//		// ...............................................

		// 2. 인터페이스도 객체화할 수 있음
		// 안의 내용물을 모듈처럼 변환하면서 사용 가능

		// 1) 인터페이스 객체화
		PrintInter p;
		// 객체화시킬 수도 있음
		// 1-1) PA 내용을 출력
		p = new PA();
		p.print();

		// 1-2) PB 내용을 출력
		p = new PB();
		p.print();

		// 1-3) PC 내용을 출력
		p = new PC();
		p.print();
		// ...............................................

// =======================================================
	}
}
